deno-app/artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Warm up the API

scenarios:
  - name: Get Hello World
    flow:
      - loop:
        - get:
            url: "/"
        count: 10